
{
    "type": "multiple-choice",
    "dimension": 1,
    "competence": "1.3",
    "level": "Básico 2",
    "title": "Almacenamiento de documentos",
    "scenario": "En Argentina, recibes digitalmente tu CUIL. ¿Dónde debes guardarlo para acceso futuro seguro?",
    "options": [
        "En una carpeta encriptada de tu dispositivo personal",
        "Impreso en varios papeles guardados en casa",
        "En un email enviado a ti mismo",
        "En la memoria USB que siempre llevas contigo"
    ],
    "correctAnswerIndex": 0,
    "feedback": {
        "correct": "✅ Correcto: El almacenamiento encriptado protege documentos sensibles.",
        "incorrect": "❌ Riesgo: Papeles y USBs pueden perderse; emails pueden hackearse."
    }
}

{
    "type": "multiple-choice",
    "dimension": 4,
    "competence": "4.1",
    "level": "Intermedio",
    "title": "Actualización de seguridad",
    "scenario": "En Chile, tu computadora muestra alertas para actualizar el sistema operativo mientras realizas un trámite bancario. ¿Qué haces?",
    "options": [
        "Posponer el trámite, actualizar inmediatamente y luego continuar",
        "Ignorar las alertas hasta terminar el trámite",
        "Actualizar solo el navegador para no interrumpir",
        "Realizar el trámite desde el celular mientras se actualiza"
    ],
    "correctAnswerIndex": 0,
    "feedback": {
        "correct": "✅ Óptimo: Actualizaciones corrigen vulnerabilidades críticas.",
        "incorrect": "❌ Peligro: Retrasar actualizaciones expone a ataques durante transacciones."
    }
}
{
    "type": "multiple-choice",
    "dimension": 1,
    "competence": "1.2",
    "level": "Avanzado",
    "title": "Credibilidad de fuentes",
    "scenario": "En México, encuentras dos portales sobre pensiones: uno en .gob.mx y otro en .org con datos similares. ¿Cómo evalúas?",
    "options": [
        "Verificar fechas de actualización y contrastar con documentos oficiales",
        "Elegir el sitio con mejor diseño gráfico",
        "Confiar en ambos por tener información coincidente",
        "Preferir el .org por ser organización sin fines de lucro"
    ],
    "correctAnswerIndex": 0,
    "feedback": {
        "correct": "✅ Excelente: La verificación cruzada con fuentes primarias es esencial.",
        "incorrect": "❌ Error: Sitios .org pueden tener sesgos aunque parezcan confiables."
    }
}
{
    "type": "multiple-choice",
    "dimension": 4,
    "competence": "4.2",
    "level": "Básico 2",
    "title": "Protección de identidad",
    "scenario": "En Perú, al crear una cuenta para trámites municipales, te piden copia de tu DNI. ¿Qué medida tomas?",
    "options": [
        "Añadir marca de agua 'PARA TRÁMITE X' sobre la imagen",
        "Enviar el escaneo sin modificaciones",
        "Nublar los dígitos del documento",
        "Compartir solo el anverso del DNI"
    ],
    "correctAnswerIndex": 0,
    "feedback": {
        "correct": "✅ Correcto: La marca de agua limita uso fraudulento.",
        "incorrect": "❌ Peligro: Documentos completos sin protección pueden ser mal utilizados."
    }
}
